# BuiltInFailures.SteelElementFailures Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SteelElementFailures Members
BuiltInFailures..::..SteelElementFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..SteelElementFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SteelElementModifyParametersTaskNotFinished | Cannot modify parameters while background calculations are in progress. |
| SteelElementModifyRangesTaskNotFinished | Cannot modify ranges while background calculations are in progress. |
| SteelElementPreviewTaskNotFinished | Cannot create preview while background calculations are in progress. |
| SteelElementPropagationTaskNotFinished | Advance Steel propagation tasks not finished. |
| SteelElementTaskNotFinished | Advance Steel tasks not finished. |

# See Also
BuiltInFailures..::..SteelElementFailures Class
Autodesk.Revit.DB Namespace